# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'phpmon'
cask 'ray'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Nerd Fonts
# cask 'font-3270-nerd-font'
# cask 'font-agave-nerd-font'
# cask 'font-anonymice-nerd-font'
# cask 'font-arimo-nerd-font'
# cask 'font-aurulent-sans-mono-nerd-font'
# cask 'font-bigblue-terminal-nerd-font'
# cask 'font-bitstream-vera-sans-mono-nerd-font'
# cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
# cask 'font-cousine-nerd-font'
# cask 'font-daddy-time-mono-nerd-font'
# cask 'font-dejavu-sans-mono-nerd-font'
# cask 'font-droid-sans-mono-nerd-font'
# cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
# cask 'font-fira-mono-nerd-font'
# cask 'font-go-mono-nerd-font'
# cask 'font-gohufont-nerd-font'
# cask 'font-hack-nerd-font'
# cask 'font-hasklug-nerd-font'
# cask 'font-heavy-data-nerd-font'
# cask 'font-hurmit-nerd-font'
# cask 'font-im-writing-nerd-font'
# cask 'font-inconsolata-go-nerd-font'
# cask 'font-inconsolata-lgc-nerd-font'
# cask 'font-inconsolata-nerd-font'
# cask 'font-iosevka-nerd-font'
# cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lekton-nerd-font'
# cask 'font-liberation-nerd-font'
cask 'font-meslo-lg-nerd-font'
# cask 'font-monofur-nerd-font'
# cask 'font-monoid-nerd-font'
# cask 'font-mononoki-nerd-font'
# cask 'font-mplus-nerd-font'
# cask 'font-noto-nerd-font'
# cask 'font-open-dyslexic-nerd-font'
# cask 'font-overpass-nerd-font'
# cask 'font-profont-nerd-font'
# cask 'font-proggy-clean-tt-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
# cask 'font-shure-tech-mono-nerd-font'
# cask 'font-space-mono-nerd-font'
# cask 'font-terminess-ttf-nerd-font'
# cask 'font-tinos-nerd-font'
# cask 'font-ubuntu-mono-nerd-font'
# cask 'font-ubuntu-nerd-font'
# cask 'font-victor-mono-nerd-font'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
